7767517
163 179
Input            input0                   0 1 input0
Convolution      301                      1 1 input0 301 0=8 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=216
BatchNorm        302                      1 1 301 302 0=8
ReLU             303                      1 1 302 303 0=1.000000e-01
Convolution      304                      1 1 303 304 0=8 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=576
BatchNorm        305                      1 1 304 305 0=8
ReLU             306                      1 1 305 306 0=1.000000e-01
Convolution      307                      1 1 306 307 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=128
BatchNorm        308                      1 1 307 308 0=16
ReLU             309                      1 1 308 309 0=1.000000e-01
Convolution      310                      1 1 309 310 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        311                      1 1 310 311 0=16
ReLU             312                      1 1 311 312 0=1.000000e-01
Convolution      313                      1 1 312 313 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=512
BatchNorm        314                      1 1 313 314 0=32
ReLU             315                      1 1 314 315 0=1.000000e-01
Convolution      316                      1 1 315 316 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=9216
BatchNorm        317                      1 1 316 317 0=32
ReLU             318                      1 1 317 318 0=1.000000e-01
Convolution      319                      1 1 318 319 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1024
BatchNorm        320                      1 1 319 320 0=32
ReLU             321                      1 1 320 321 0=1.000000e-01
Convolution      322                      1 1 321 322 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=9216
BatchNorm        323                      1 1 322 323 0=32
ReLU             324                      1 1 323 324 0=1.000000e-01
Convolution      325                      1 1 324 325 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2048
BatchNorm        326                      1 1 325 326 0=64
ReLU             327                      1 1 326 327 0=1.000000e-01
Convolution      328                      1 1 327 328 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=36864
BatchNorm        329                      1 1 328 329 0=64
ReLU             330                      1 1 329 330 0=1.000000e-01
Convolution      331                      1 1 330 331 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4096
BatchNorm        332                      1 1 331 332 0=64
ReLU             333                      1 1 332 333 0=1.000000e-01
Split            splitncnn_0              1 2 333 333_splitncnn_0 333_splitncnn_1
Convolution      334                      1 1 333_splitncnn_1 334 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=36864
BatchNorm        335                      1 1 334 335 0=64
ReLU             336                      1 1 335 336 0=1.000000e-01
Convolution      337                      1 1 336 337 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8192
BatchNorm        338                      1 1 337 338 0=128
ReLU             339                      1 1 338 339 0=1.000000e-01
Convolution      340                      1 1 339 340 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=147456
BatchNorm        341                      1 1 340 341 0=128
ReLU             342                      1 1 341 342 0=1.000000e-01
Convolution      343                      1 1 342 343 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
BatchNorm        344                      1 1 343 344 0=128
ReLU             345                      1 1 344 345 0=1.000000e-01
Convolution      346                      1 1 345 346 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=147456
BatchNorm        347                      1 1 346 347 0=128
ReLU             348                      1 1 347 348 0=1.000000e-01
Convolution      349                      1 1 348 349 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
BatchNorm        350                      1 1 349 350 0=128
ReLU             351                      1 1 350 351 0=1.000000e-01
Convolution      352                      1 1 351 352 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=147456
BatchNorm        353                      1 1 352 353 0=128
ReLU             354                      1 1 353 354 0=1.000000e-01
Convolution      355                      1 1 354 355 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
BatchNorm        356                      1 1 355 356 0=128
ReLU             357                      1 1 356 357 0=1.000000e-01
Convolution      358                      1 1 357 358 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=147456
BatchNorm        359                      1 1 358 359 0=128
ReLU             360                      1 1 359 360 0=1.000000e-01
Convolution      361                      1 1 360 361 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
BatchNorm        362                      1 1 361 362 0=128
ReLU             363                      1 1 362 363 0=1.000000e-01
Convolution      364                      1 1 363 364 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=147456
BatchNorm        365                      1 1 364 365 0=128
ReLU             366                      1 1 365 366 0=1.000000e-01
Convolution      367                      1 1 366 367 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
BatchNorm        368                      1 1 367 368 0=128
ReLU             369                      1 1 368 369 0=1.000000e-01
Split            splitncnn_1              1 2 369 369_splitncnn_0 369_splitncnn_1
Convolution      370                      1 1 369_splitncnn_1 370 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=147456
BatchNorm        371                      1 1 370 371 0=128
ReLU             372                      1 1 371 372 0=1.000000e-01
Convolution      373                      1 1 372 373 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        374                      1 1 373 374 0=256
ReLU             375                      1 1 374 375 0=1.000000e-01
Convolution      376                      1 1 375 376 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=589824
BatchNorm        377                      1 1 376 377 0=256
ReLU             378                      1 1 377 378 0=1.000000e-01
Convolution      379                      1 1 378 379 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=65536
BatchNorm        380                      1 1 379 380 0=256
ReLU             381                      1 1 380 381 0=1.000000e-01
Convolution      382                      1 1 333_splitncnn_0 382 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4096
BatchNorm        383                      1 1 382 383 0=64
ReLU             384                      1 1 383 384 0=1.000000e-01
Convolution      385                      1 1 369_splitncnn_0 385 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8192
BatchNorm        386                      1 1 385 386 0=64
ReLU             387                      1 1 386 387 0=1.000000e-01
Convolution      388                      1 1 381 388 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
BatchNorm        389                      1 1 388 389 0=64
ReLU             390                      1 1 389 390 0=1.000000e-01
Split            splitncnn_2              1 3 390 390_splitncnn_0 390_splitncnn_1 390_splitncnn_2
Interp           418                      1 1 390_splitncnn_2 418 0=1 1=2.000000e+00 2=2.000000e+00
BinaryOp         419                      2 1 387 418 419 0=0
Convolution      420                      1 1 419 420 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=36864
BatchNorm        421                      1 1 420 421 0=64
ReLU             422                      1 1 421 422 0=1.000000e-01
Split            splitncnn_3              1 3 422 422_splitncnn_0 422_splitncnn_1 422_splitncnn_2
Interp           450                      1 1 422_splitncnn_2 450 0=1 1=2.000000e+00 2=2.000000e+00
BinaryOp         451                      2 1 384 450 451 0=0
Convolution      452                      1 1 451 452 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=36864
BatchNorm        453                      1 1 452 453 0=64
ReLU             454                      1 1 453 454 0=1.000000e-01
Split            splitncnn_4              1 2 454 454_splitncnn_0 454_splitncnn_1
Convolution      455                      1 1 454_splitncnn_1 455 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=18432
BatchNorm        456                      1 1 455 456 0=32
Convolution      457                      1 1 454_splitncnn_0 457 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=9216
BatchNorm        458                      1 1 457 458 0=16
ReLU             459                      1 1 458 459 0=1.000000e-01
Split            splitncnn_5              1 2 459 459_splitncnn_0 459_splitncnn_1
Convolution      460                      1 1 459_splitncnn_1 460 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        461                      1 1 460 461 0=16
Convolution      462                      1 1 459_splitncnn_0 462 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        463                      1 1 462 463 0=16
ReLU             464                      1 1 463 464 0=1.000000e-01
Convolution      465                      1 1 464 465 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        466                      1 1 465 466 0=16
Concat           467                      3 1 456 461 466 467 0=0
ReLU             468                      1 1 467 468
Split            splitncnn_6              1 3 468 468_splitncnn_0 468_splitncnn_1 468_splitncnn_2
Convolution      469                      1 1 422_splitncnn_1 469 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=18432
BatchNorm        470                      1 1 469 470 0=32
Convolution      471                      1 1 422_splitncnn_0 471 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=9216
BatchNorm        472                      1 1 471 472 0=16
ReLU             473                      1 1 472 473 0=1.000000e-01
Split            splitncnn_7              1 2 473 473_splitncnn_0 473_splitncnn_1
Convolution      474                      1 1 473_splitncnn_1 474 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        475                      1 1 474 475 0=16
Convolution      476                      1 1 473_splitncnn_0 476 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        477                      1 1 476 477 0=16
ReLU             478                      1 1 477 478 0=1.000000e-01
Convolution      479                      1 1 478 479 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        480                      1 1 479 480 0=16
Concat           481                      3 1 470 475 480 481 0=0
ReLU             482                      1 1 481 482
Split            splitncnn_8              1 3 482 482_splitncnn_0 482_splitncnn_1 482_splitncnn_2
Convolution      483                      1 1 390_splitncnn_1 483 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=18432
BatchNorm        484                      1 1 483 484 0=32
Convolution      485                      1 1 390_splitncnn_0 485 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=9216
BatchNorm        486                      1 1 485 486 0=16
ReLU             487                      1 1 486 487 0=1.000000e-01
Split            splitncnn_9              1 2 487 487_splitncnn_0 487_splitncnn_1
Convolution      488                      1 1 487_splitncnn_1 488 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        489                      1 1 488 489 0=16
Convolution      490                      1 1 487_splitncnn_0 490 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        491                      1 1 490 491 0=16
ReLU             492                      1 1 491 492 0=1.000000e-01
Convolution      493                      1 1 492 493 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        494                      1 1 493 494 0=16
Concat           495                      3 1 484 489 494 495 0=0
ReLU             496                      1 1 495 496
Split            splitncnn_10             1 3 496 496_splitncnn_0 496_splitncnn_1 496_splitncnn_2
Convolution      output0                  1 1 468_splitncnn_2 output0 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
Convolution      498                      1 1 468_splitncnn_1 498 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Convolution      499                      1 1 468_splitncnn_0 499 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=5120
Convolution      500                      1 1 482_splitncnn_2 500 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
Convolution      501                      1 1 482_splitncnn_1 501 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Convolution      502                      1 1 482_splitncnn_0 502 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=5120
Convolution      503                      1 1 496_splitncnn_2 503 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
Convolution      504                      1 1 496_splitncnn_1 504 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Convolution      505                      1 1 496_splitncnn_0 505 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=5120
