7767517
199 242
Input            input0                   0 1 input0
Convolution      325                      1 1 input0 325 0=8 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=216
BatchNorm        326                      1 1 325 326 0=8
ReLU             327                      1 1 326 327 0=1.000000e-01
ConvolutionDepthWise 328                      1 1 327 328 0=8 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=72 7=8
BatchNorm        329                      1 1 328 329 0=8
ReLU             330                      1 1 329 330 0=1.000000e-01
Convolution      331                      1 1 330 331 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=128
BatchNorm        332                      1 1 331 332 0=16
ReLU             333                      1 1 332 333 0=1.000000e-01
ConvolutionDepthWise 334                      1 1 333 334 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=144 7=16
BatchNorm        335                      1 1 334 335 0=16
ReLU             336                      1 1 335 336 0=1.000000e-01
Convolution      337                      1 1 336 337 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=512
BatchNorm        338                      1 1 337 338 0=32
ReLU             339                      1 1 338 339 0=1.000000e-01
ConvolutionDepthWise 340                      1 1 339 340 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=288 7=32
BatchNorm        341                      1 1 340 341 0=32
ReLU             342                      1 1 341 342 0=1.000000e-01
Convolution      343                      1 1 342 343 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1024
BatchNorm        344                      1 1 343 344 0=32
ReLU             345                      1 1 344 345 0=1.000000e-01
ConvolutionDepthWise 346                      1 1 345 346 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=288 7=32
BatchNorm        347                      1 1 346 347 0=32
ReLU             348                      1 1 347 348 0=1.000000e-01
Convolution      349                      1 1 348 349 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2048
BatchNorm        350                      1 1 349 350 0=64
ReLU             351                      1 1 350 351 0=1.000000e-01
ConvolutionDepthWise 352                      1 1 351 352 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=576 7=64
BatchNorm        353                      1 1 352 353 0=64
ReLU             354                      1 1 353 354 0=1.000000e-01
Convolution      355                      1 1 354 355 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4096
BatchNorm        356                      1 1 355 356 0=64
ReLU             357                      1 1 356 357 0=1.000000e-01
Split            splitncnn_0              1 2 357 357_splitncnn_0 357_splitncnn_1
ConvolutionDepthWise 358                      1 1 357_splitncnn_1 358 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=576 7=64
BatchNorm        359                      1 1 358 359 0=64
ReLU             360                      1 1 359 360 0=1.000000e-01
Convolution      361                      1 1 360 361 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8192
BatchNorm        362                      1 1 361 362 0=128
ReLU             363                      1 1 362 363 0=1.000000e-01
ConvolutionDepthWise 364                      1 1 363 364 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1152 7=128
BatchNorm        365                      1 1 364 365 0=128
ReLU             366                      1 1 365 366 0=1.000000e-01
Convolution      367                      1 1 366 367 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
BatchNorm        368                      1 1 367 368 0=128
ReLU             369                      1 1 368 369 0=1.000000e-01
ConvolutionDepthWise 370                      1 1 369 370 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1152 7=128
BatchNorm        371                      1 1 370 371 0=128
ReLU             372                      1 1 371 372 0=1.000000e-01
Convolution      373                      1 1 372 373 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
BatchNorm        374                      1 1 373 374 0=128
ReLU             375                      1 1 374 375 0=1.000000e-01
ConvolutionDepthWise 376                      1 1 375 376 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1152 7=128
BatchNorm        377                      1 1 376 377 0=128
ReLU             378                      1 1 377 378 0=1.000000e-01
Convolution      379                      1 1 378 379 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
BatchNorm        380                      1 1 379 380 0=128
ReLU             381                      1 1 380 381 0=1.000000e-01
ConvolutionDepthWise 382                      1 1 381 382 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1152 7=128
BatchNorm        383                      1 1 382 383 0=128
ReLU             384                      1 1 383 384 0=1.000000e-01
Convolution      385                      1 1 384 385 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
BatchNorm        386                      1 1 385 386 0=128
ReLU             387                      1 1 386 387 0=1.000000e-01
ConvolutionDepthWise 388                      1 1 387 388 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1152 7=128
BatchNorm        389                      1 1 388 389 0=128
ReLU             390                      1 1 389 390 0=1.000000e-01
Convolution      391                      1 1 390 391 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
BatchNorm        392                      1 1 391 392 0=128
ReLU             393                      1 1 392 393 0=1.000000e-01
Split            splitncnn_1              1 2 393 393_splitncnn_0 393_splitncnn_1
ConvolutionDepthWise 394                      1 1 393_splitncnn_1 394 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=1152 7=128
BatchNorm        395                      1 1 394 395 0=128
ReLU             396                      1 1 395 396 0=1.000000e-01
Convolution      397                      1 1 396 397 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        398                      1 1 397 398 0=256
ReLU             399                      1 1 398 399 0=1.000000e-01
ConvolutionDepthWise 400                      1 1 399 400 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304 7=256
BatchNorm        401                      1 1 400 401 0=256
ReLU             402                      1 1 401 402 0=1.000000e-01
Convolution      403                      1 1 402 403 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=65536
BatchNorm        404                      1 1 403 404 0=256
ReLU             405                      1 1 404 405 0=1.000000e-01
Convolution      406                      1 1 357_splitncnn_0 406 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4096
BatchNorm        407                      1 1 406 407 0=64
ReLU             408                      1 1 407 408 0=1.000000e-01
Convolution      409                      1 1 393_splitncnn_0 409 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8192
BatchNorm        410                      1 1 409 410 0=64
ReLU             411                      1 1 410 411 0=1.000000e-01
Convolution      412                      1 1 405 412 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
BatchNorm        413                      1 1 412 413 0=64
ReLU             414                      1 1 413 414 0=1.000000e-01
Split            splitncnn_2              1 3 414 414_splitncnn_0 414_splitncnn_1 414_splitncnn_2
Interp           442                      1 1 414_splitncnn_2 442 0=1 1=1.000000e+00 2=1.000000e+00 3=40 4=40
BinaryOp         443                      2 1 411 442 443 0=0
Convolution      444                      1 1 443 444 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=36864
BatchNorm        445                      1 1 444 445 0=64
ReLU             446                      1 1 445 446 0=1.000000e-01
Split            splitncnn_3              1 3 446 446_splitncnn_0 446_splitncnn_1 446_splitncnn_2
Interp           474                      1 1 446_splitncnn_2 474 0=1 1=1.000000e+00 2=1.000000e+00 3=80 4=80
BinaryOp         475                      2 1 408 474 475 0=0
Convolution      476                      1 1 475 476 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=36864
BatchNorm        477                      1 1 476 477 0=64
ReLU             478                      1 1 477 478 0=1.000000e-01
Split            splitncnn_4              1 2 478 478_splitncnn_0 478_splitncnn_1
Convolution      479                      1 1 478_splitncnn_1 479 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=18432
BatchNorm        480                      1 1 479 480 0=32
Convolution      481                      1 1 478_splitncnn_0 481 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=9216
BatchNorm        482                      1 1 481 482 0=16
ReLU             483                      1 1 482 483 0=1.000000e-01
Split            splitncnn_5              1 2 483 483_splitncnn_0 483_splitncnn_1
Convolution      484                      1 1 483_splitncnn_1 484 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        485                      1 1 484 485 0=16
Convolution      486                      1 1 483_splitncnn_0 486 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        487                      1 1 486 487 0=16
ReLU             488                      1 1 487 488 0=1.000000e-01
Convolution      489                      1 1 488 489 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        490                      1 1 489 490 0=16
Concat           491                      3 1 480 485 490 491 0=0
ReLU             492                      1 1 491 492
Split            splitncnn_6              1 7 492 492_splitncnn_0 492_splitncnn_1 492_splitncnn_2 492_splitncnn_3 492_splitncnn_4 492_splitncnn_5 492_splitncnn_6
Convolution      493                      1 1 446_splitncnn_1 493 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=18432
BatchNorm        494                      1 1 493 494 0=32
Convolution      495                      1 1 446_splitncnn_0 495 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=9216
BatchNorm        496                      1 1 495 496 0=16
ReLU             497                      1 1 496 497 0=1.000000e-01
Split            splitncnn_7              1 2 497 497_splitncnn_0 497_splitncnn_1
Convolution      498                      1 1 497_splitncnn_1 498 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        499                      1 1 498 499 0=16
Convolution      500                      1 1 497_splitncnn_0 500 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        501                      1 1 500 501 0=16
ReLU             502                      1 1 501 502 0=1.000000e-01
Convolution      503                      1 1 502 503 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        504                      1 1 503 504 0=16
Concat           505                      3 1 494 499 504 505 0=0
ReLU             506                      1 1 505 506
Split            splitncnn_8              1 7 506 506_splitncnn_0 506_splitncnn_1 506_splitncnn_2 506_splitncnn_3 506_splitncnn_4 506_splitncnn_5 506_splitncnn_6
Convolution      507                      1 1 414_splitncnn_1 507 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=18432
BatchNorm        508                      1 1 507 508 0=32
Convolution      509                      1 1 414_splitncnn_0 509 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=9216
BatchNorm        510                      1 1 509 510 0=16
ReLU             511                      1 1 510 511 0=1.000000e-01
Split            splitncnn_9              1 2 511 511_splitncnn_0 511_splitncnn_1
Convolution      512                      1 1 511_splitncnn_1 512 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        513                      1 1 512 513 0=16
Convolution      514                      1 1 511_splitncnn_0 514 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        515                      1 1 514 515 0=16
ReLU             516                      1 1 515 516 0=1.000000e-01
Convolution      517                      1 1 516 517 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        518                      1 1 517 518 0=16
Concat           519                      3 1 508 513 518 519 0=0
ReLU             520                      1 1 519 520
Split            splitncnn_10             1 7 520 520_splitncnn_0 520_splitncnn_1 520_splitncnn_2 520_splitncnn_3 520_splitncnn_4 520_splitncnn_5 520_splitncnn_6
Convolution      output0                  1 1 492_splitncnn_6 output0 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
Convolution      522                      1 1 492_splitncnn_5 522 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Convolution      523                      1 1 492_splitncnn_4 523 0=68 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4352
Convolution      524                      1 1 492_splitncnn_3 524 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2560
Convolution      525                      1 1 492_splitncnn_2 525 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3072
Convolution      526                      1 1 492_splitncnn_1 526 0=36 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
Convolution      527                      1 1 492_splitncnn_0 527 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=5120
Slice            528                      1 2 523 528 529 -23300=2,34,-233 1=0
Slice            530                      1 2 524 530 531 -23300=2,20,-233 1=0
Slice            532                      1 2 525 532 533 -23300=2,24,-233 1=0
Slice            534                      1 2 526 534 535 -23300=2,18,-233 1=0
Slice            536                      1 2 527 536 537 -23300=2,40,-233 1=0
Concat           538                      5 1 528 530 532 534 536 538 0=0
Concat           539                      5 1 529 531 533 535 537 539 0=0
Concat           540                      2 1 538 539 540 0=0
Convolution      541                      1 1 506_splitncnn_6 541 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
Convolution      542                      1 1 506_splitncnn_5 542 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Convolution      543                      1 1 506_splitncnn_4 543 0=68 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4352
Convolution      544                      1 1 506_splitncnn_3 544 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2560
Convolution      545                      1 1 506_splitncnn_2 545 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3072
Convolution      546                      1 1 506_splitncnn_1 546 0=36 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
Convolution      547                      1 1 506_splitncnn_0 547 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=5120
Slice            548                      1 2 543 548 549 -23300=2,34,-233 1=0
Slice            550                      1 2 544 550 551 -23300=2,20,-233 1=0
Slice            552                      1 2 545 552 553 -23300=2,24,-233 1=0
Slice            554                      1 2 546 554 555 -23300=2,18,-233 1=0
Slice            556                      1 2 547 556 557 -23300=2,40,-233 1=0
Concat           558                      5 1 548 550 552 554 556 558 0=0
Concat           559                      5 1 549 551 553 555 557 559 0=0
Concat           560                      2 1 558 559 560 0=0
Convolution      561                      1 1 520_splitncnn_6 561 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
Convolution      562                      1 1 520_splitncnn_5 562 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Convolution      563                      1 1 520_splitncnn_4 563 0=68 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4352
Convolution      564                      1 1 520_splitncnn_3 564 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2560
Convolution      565                      1 1 520_splitncnn_2 565 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3072
Convolution      566                      1 1 520_splitncnn_1 566 0=36 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
Convolution      567                      1 1 520_splitncnn_0 567 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=5120
Slice            568                      1 2 563 568 569 -23300=2,34,-233 1=0
Slice            570                      1 2 564 570 571 -23300=2,20,-233 1=0
Slice            572                      1 2 565 572 573 -23300=2,24,-233 1=0
Slice            574                      1 2 566 574 575 -23300=2,18,-233 1=0
Slice            576                      1 2 567 576 577 -23300=2,40,-233 1=0
Concat           578                      5 1 568 570 572 574 576 578 0=0
Concat           579                      5 1 569 571 573 575 577 579 0=0
Concat           580                      2 1 578 579 580 0=0
