7767517
199 242
Input            input0                   0 1 input0
Convolution      325                      1 1 input0 325 0=8 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=216
BatchNorm        326                      1 1 325 326 0=8
ReLU             327                      1 1 326 327 0=1.000000e-01
Convolution      328                      1 1 327 328 0=8 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=576
BatchNorm        329                      1 1 328 329 0=8
ReLU             330                      1 1 329 330 0=1.000000e-01
Convolution      331                      1 1 330 331 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=128
BatchNorm        332                      1 1 331 332 0=16
ReLU             333                      1 1 332 333 0=1.000000e-01
Convolution      334                      1 1 333 334 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        335                      1 1 334 335 0=16
ReLU             336                      1 1 335 336 0=1.000000e-01
Convolution      337                      1 1 336 337 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=512
BatchNorm        338                      1 1 337 338 0=32
ReLU             339                      1 1 338 339 0=1.000000e-01
Convolution      340                      1 1 339 340 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=9216
BatchNorm        341                      1 1 340 341 0=32
ReLU             342                      1 1 341 342 0=1.000000e-01
Convolution      343                      1 1 342 343 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1024
BatchNorm        344                      1 1 343 344 0=32
ReLU             345                      1 1 344 345 0=1.000000e-01
Convolution      346                      1 1 345 346 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=9216
BatchNorm        347                      1 1 346 347 0=32
ReLU             348                      1 1 347 348 0=1.000000e-01
Convolution      349                      1 1 348 349 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2048
BatchNorm        350                      1 1 349 350 0=64
ReLU             351                      1 1 350 351 0=1.000000e-01
Convolution      352                      1 1 351 352 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=36864
BatchNorm        353                      1 1 352 353 0=64
ReLU             354                      1 1 353 354 0=1.000000e-01
Convolution      355                      1 1 354 355 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4096
BatchNorm        356                      1 1 355 356 0=64
ReLU             357                      1 1 356 357 0=1.000000e-01
Split            splitncnn_0              1 2 357 357_splitncnn_0 357_splitncnn_1
Convolution      358                      1 1 357_splitncnn_1 358 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=36864
BatchNorm        359                      1 1 358 359 0=64
ReLU             360                      1 1 359 360 0=1.000000e-01
Convolution      361                      1 1 360 361 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8192
BatchNorm        362                      1 1 361 362 0=128
ReLU             363                      1 1 362 363 0=1.000000e-01
Convolution      364                      1 1 363 364 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=147456
BatchNorm        365                      1 1 364 365 0=128
ReLU             366                      1 1 365 366 0=1.000000e-01
Convolution      367                      1 1 366 367 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
BatchNorm        368                      1 1 367 368 0=128
ReLU             369                      1 1 368 369 0=1.000000e-01
Convolution      370                      1 1 369 370 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=147456
BatchNorm        371                      1 1 370 371 0=128
ReLU             372                      1 1 371 372 0=1.000000e-01
Convolution      373                      1 1 372 373 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
BatchNorm        374                      1 1 373 374 0=128
ReLU             375                      1 1 374 375 0=1.000000e-01
Convolution      376                      1 1 375 376 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=147456
BatchNorm        377                      1 1 376 377 0=128
ReLU             378                      1 1 377 378 0=1.000000e-01
Convolution      379                      1 1 378 379 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
BatchNorm        380                      1 1 379 380 0=128
ReLU             381                      1 1 380 381 0=1.000000e-01
Convolution      382                      1 1 381 382 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=147456
BatchNorm        383                      1 1 382 383 0=128
ReLU             384                      1 1 383 384 0=1.000000e-01
Convolution      385                      1 1 384 385 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
BatchNorm        386                      1 1 385 386 0=128
ReLU             387                      1 1 386 387 0=1.000000e-01
Convolution      388                      1 1 387 388 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=147456
BatchNorm        389                      1 1 388 389 0=128
ReLU             390                      1 1 389 390 0=1.000000e-01
Convolution      391                      1 1 390 391 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
BatchNorm        392                      1 1 391 392 0=128
ReLU             393                      1 1 392 393 0=1.000000e-01
Split            splitncnn_1              1 2 393 393_splitncnn_0 393_splitncnn_1
Convolution      394                      1 1 393_splitncnn_1 394 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=147456
BatchNorm        395                      1 1 394 395 0=128
ReLU             396                      1 1 395 396 0=1.000000e-01
Convolution      397                      1 1 396 397 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        398                      1 1 397 398 0=256
ReLU             399                      1 1 398 399 0=1.000000e-01
Convolution      400                      1 1 399 400 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=589824
BatchNorm        401                      1 1 400 401 0=256
ReLU             402                      1 1 401 402 0=1.000000e-01
Convolution      403                      1 1 402 403 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=65536
BatchNorm        404                      1 1 403 404 0=256
ReLU             405                      1 1 404 405 0=1.000000e-01
Convolution      406                      1 1 357_splitncnn_0 406 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4096
BatchNorm        407                      1 1 406 407 0=64
ReLU             408                      1 1 407 408 0=1.000000e-01
Convolution      409                      1 1 393_splitncnn_0 409 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8192
BatchNorm        410                      1 1 409 410 0=64
ReLU             411                      1 1 410 411 0=1.000000e-01
Convolution      412                      1 1 405 412 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
BatchNorm        413                      1 1 412 413 0=64
ReLU             414                      1 1 413 414 0=1.000000e-01
Split            splitncnn_2              1 3 414 414_splitncnn_0 414_splitncnn_1 414_splitncnn_2
Interp           432                      1 1 414_splitncnn_2 432 0=1 1=2.000000e+00 2=2.000000e+00
BinaryOp         433                      2 1 411 432 433 0=0
Convolution      434                      1 1 433 434 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=36864
BatchNorm        435                      1 1 434 435 0=64
ReLU             436                      1 1 435 436 0=1.000000e-01
Split            splitncnn_3              1 3 436 436_splitncnn_0 436_splitncnn_1 436_splitncnn_2
Interp           454                      1 1 436_splitncnn_2 454 0=1 1=2.000000e+00 2=2.000000e+00
BinaryOp         455                      2 1 408 454 455 0=0
Convolution      456                      1 1 455 456 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=36864
BatchNorm        457                      1 1 456 457 0=64
ReLU             458                      1 1 457 458 0=1.000000e-01
Split            splitncnn_4              1 2 458 458_splitncnn_0 458_splitncnn_1
Convolution      459                      1 1 458_splitncnn_1 459 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=18432
BatchNorm        460                      1 1 459 460 0=32
Convolution      461                      1 1 458_splitncnn_0 461 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=9216
BatchNorm        462                      1 1 461 462 0=16
ReLU             463                      1 1 462 463 0=1.000000e-01
Split            splitncnn_5              1 2 463 463_splitncnn_0 463_splitncnn_1
Convolution      464                      1 1 463_splitncnn_1 464 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        465                      1 1 464 465 0=16
Convolution      466                      1 1 463_splitncnn_0 466 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        467                      1 1 466 467 0=16
ReLU             468                      1 1 467 468 0=1.000000e-01
Convolution      469                      1 1 468 469 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        470                      1 1 469 470 0=16
Concat           471                      3 1 460 465 470 471 0=0
ReLU             472                      1 1 471 472
Split            splitncnn_6              1 7 472 472_splitncnn_0 472_splitncnn_1 472_splitncnn_2 472_splitncnn_3 472_splitncnn_4 472_splitncnn_5 472_splitncnn_6
Convolution      473                      1 1 436_splitncnn_1 473 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=18432
BatchNorm        474                      1 1 473 474 0=32
Convolution      475                      1 1 436_splitncnn_0 475 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=9216
BatchNorm        476                      1 1 475 476 0=16
ReLU             477                      1 1 476 477 0=1.000000e-01
Split            splitncnn_7              1 2 477 477_splitncnn_0 477_splitncnn_1
Convolution      478                      1 1 477_splitncnn_1 478 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        479                      1 1 478 479 0=16
Convolution      480                      1 1 477_splitncnn_0 480 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        481                      1 1 480 481 0=16
ReLU             482                      1 1 481 482 0=1.000000e-01
Convolution      483                      1 1 482 483 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        484                      1 1 483 484 0=16
Concat           485                      3 1 474 479 484 485 0=0
ReLU             486                      1 1 485 486
Split            splitncnn_8              1 7 486 486_splitncnn_0 486_splitncnn_1 486_splitncnn_2 486_splitncnn_3 486_splitncnn_4 486_splitncnn_5 486_splitncnn_6
Convolution      487                      1 1 414_splitncnn_1 487 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=18432
BatchNorm        488                      1 1 487 488 0=32
Convolution      489                      1 1 414_splitncnn_0 489 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=9216
BatchNorm        490                      1 1 489 490 0=16
ReLU             491                      1 1 490 491 0=1.000000e-01
Split            splitncnn_9              1 2 491 491_splitncnn_0 491_splitncnn_1
Convolution      492                      1 1 491_splitncnn_1 492 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        493                      1 1 492 493 0=16
Convolution      494                      1 1 491_splitncnn_0 494 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        495                      1 1 494 495 0=16
ReLU             496                      1 1 495 496 0=1.000000e-01
Convolution      497                      1 1 496 497 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        498                      1 1 497 498 0=16
Concat           499                      3 1 488 493 498 499 0=0
ReLU             500                      1 1 499 500
Split            splitncnn_10             1 7 500 500_splitncnn_0 500_splitncnn_1 500_splitncnn_2 500_splitncnn_3 500_splitncnn_4 500_splitncnn_5 500_splitncnn_6
Convolution      output0                  1 1 472_splitncnn_6 output0 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
Convolution      502                      1 1 472_splitncnn_5 502 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Convolution      503                      1 1 472_splitncnn_4 503 0=68 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4352
Convolution      504                      1 1 472_splitncnn_3 504 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2560
Convolution      505                      1 1 472_splitncnn_2 505 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3072
Convolution      506                      1 1 472_splitncnn_1 506 0=36 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
Convolution      507                      1 1 472_splitncnn_0 507 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=5120
Slice            508                      1 2 503 508 509 -23300=2,34,-233 1=0
Slice            510                      1 2 504 510 511 -23300=2,20,-233 1=0
Slice            512                      1 2 505 512 513 -23300=2,24,-233 1=0
Slice            514                      1 2 506 514 515 -23300=2,18,-233 1=0
Slice            516                      1 2 507 516 517 -23300=2,40,-233 1=0
Concat           518                      5 1 508 510 512 514 516 518 0=0
Concat           519                      5 1 509 511 513 515 517 519 0=0
Concat           520                      2 1 518 519 520 0=0
Convolution      521                      1 1 486_splitncnn_6 521 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
Convolution      522                      1 1 486_splitncnn_5 522 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Convolution      523                      1 1 486_splitncnn_4 523 0=68 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4352
Convolution      524                      1 1 486_splitncnn_3 524 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2560
Convolution      525                      1 1 486_splitncnn_2 525 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3072
Convolution      526                      1 1 486_splitncnn_1 526 0=36 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
Convolution      527                      1 1 486_splitncnn_0 527 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=5120
Slice            528                      1 2 523 528 529 -23300=2,34,-233 1=0
Slice            530                      1 2 524 530 531 -23300=2,20,-233 1=0
Slice            532                      1 2 525 532 533 -23300=2,24,-233 1=0
Slice            534                      1 2 526 534 535 -23300=2,18,-233 1=0
Slice            536                      1 2 527 536 537 -23300=2,40,-233 1=0
Concat           538                      5 1 528 530 532 534 536 538 0=0
Concat           539                      5 1 529 531 533 535 537 539 0=0
Concat           540                      2 1 538 539 540 0=0
Convolution      541                      1 1 500_splitncnn_6 541 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
Convolution      542                      1 1 500_splitncnn_5 542 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Convolution      543                      1 1 500_splitncnn_4 543 0=68 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4352
Convolution      544                      1 1 500_splitncnn_3 544 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2560
Convolution      545                      1 1 500_splitncnn_2 545 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3072
Convolution      546                      1 1 500_splitncnn_1 546 0=36 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
Convolution      547                      1 1 500_splitncnn_0 547 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=5120
Slice            548                      1 2 543 548 549 -23300=2,34,-233 1=0
Slice            550                      1 2 544 550 551 -23300=2,20,-233 1=0
Slice            552                      1 2 545 552 553 -23300=2,24,-233 1=0
Slice            554                      1 2 546 554 555 -23300=2,18,-233 1=0
Slice            556                      1 2 547 556 557 -23300=2,40,-233 1=0
Concat           558                      5 1 548 550 552 554 556 558 0=0
Concat           559                      5 1 549 551 553 555 557 559 0=0
Concat           560                      2 1 558 559 560 0=0
